# Actividad con Kaggle

In [8]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [12]:
from sklearn.neighbors import KNeighborsClassifier
from sklearn.tree import DecisionTreeClassifier
from sklearn.ensemble import RandomForestClassifier
from sklearn.naive_bayes import GaussianNB
from sklearn.svm import SVC
from sklearn.metrics import accuracy_score
from sklearn.model_selection import train_test_split

In [14]:
train_file= 'train.csv'

df= pd.read_csv(train_file)

df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [15]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [16]:
df.Age.isnull().sum()

np.int64(177)

In [17]:
df.Age= df.Age.fillna(df.Age.mean())

In [18]:
df.Age.isnull().sum()

np.int64(0)

In [19]:
df.Embarked.isnull().sum()

np.int64(2)

In [20]:
df.Embarked.value_counts()

Embarked
S    644
C    168
Q     77
Name: count, dtype: int64

In [ ]:
# Para obtener otras predicciones diferentes a las del manual, fillna ser√° la clase C y no S
df["Embarked"]= df["Embarked"].fillna('C')
df.Embarked.value_counts()

Embarked
S    644
C    170
Q     77
Name: count, dtype: int64

In [23]:
df.drop(["Name","Ticket","Cabin","PassengerId"], axis=1,inplace=True)
df.head(2)

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C

### Datos Categ√≥ricos

In [24]:
df= pd.get_dummies(df,columns=['Sex','Pclass','Embarked'], drop_first=True)
df.head()

,Survived,Age,SibSp,Parch,Fare,Sex_male,Pclass_2,Pclass_3,Embarked_Q,Embarked_S
0,0,22.0,1,0,7.2500,True,False,True,False,True
1,1,38.0,1,0,71.2833,False,False,False,False,False
2,1,26.0,0,0,7.9250,False,False,True,False,True
3,1,35.0,1,0,53.1000,False,False,False,False,True
4,0,35.0,0,0,8.0500,True,False,True,False,True

### Escalado de datos

In [25]:
df.Age= (df.Age - np.mean(df.Age, axis=0)) / (np.std(df.Age, axis=0))
df.Fare= (df.Fare - np.mean(df.Fare, axis=0)) / (np.std(df.Fare, axis=0))
df.head()

,Survived,Age,SibSp,Parch,Fare,Sex_male,Pclass_2,Pclass_3,Embarked_Q,Embarked_S
0,0,-0.592481,1,0,-0.502445,True,False,True,False,True
1,1,0.638789,1,0,0.786845,False,False,False,False,False
2,1,-0.284663,0,0,-0.488854,False,False,True,False,True
3,1,0.407926,1,0,0.420730,False,False,False,False,True
4,0,0.407926,0,0,-0.486337,True,False,True,False,True

## Obtenci√≥n de x,y

In [26]:
X= df.drop("Survived",axis=1)
X.head()

,Age,SibSp,Parch,Fare,Sex_male,Pclass_2,Pclass_3,Embarked_Q,Embarked_S
0,-0.592481,1,0,-0.502445,True,False,True,False,True
1,0.638789,1,0,0.786845,False,False,False,False,False
2,-0.284663,0,0,-0.488854,False,False,True,False,True
3,0.407926,1,0,0.420730,False,False,False,False,True
4,0.407926,0,0,-0.486337,True,False,True,False,True

In [27]:
y= df["Survived"]
y.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [28]:
X_train,X_test, y_train, y_test = train_test_split(X,y, test_size=0.2, random_state=42)

In [29]:
X_train.head()

,Age,SibSp,Parch,Fare,Sex_male,Pclass_2,Pclass_3,Embarked_Q,Embarked_S
331,1.215947,0,0,-0.074583,True,False,False,False,True
733,-0.515526,0,0,-0.386671,True,True,False,False,True
382,0.177063,0,0,-0.488854,True,False,True,False,True
704,-0.284663,1,0,-0.490280,True,False,True,False,True
813,-1.823750,4,2,-0.018709,False,False,True,False,True

In [30]:
X_test.head()

,Age,SibSp,Parch,Fare,Sex_male,Pclass_2,Pclass_3,Embarked_Q,Embarked_S
709,0.000000,1,1,-0.341452,True,False,True,False,False
439,0.100109,0,0,-0.437007,True,True,False,False,True
840,-0.746389,0,0,-0.488854,True,False,True,False,True
720,-1.823750,0,1,0.016023,False,True,False,False,True
39,-1.208115,1,0,-0.422074,False,False,True,False,False

In [31]:
y_train.head()

331    0
733    0
382    0
704    0
813    0
Name: Survived, dtype: int64

In [32]:
y_test.head()

709    1
439    0
840    0
720    1
39     1
Name: Survived, dtype: int64

## Algoritmos de clasificaci√≥n

In [33]:
# KNeighborsClassifier
clf= KNeighborsClassifier()
clf.fit(X_train,y_train)
y_pred= clf.predict(X_test)
acc_KN= accuracy_score(y_test, y_pred)
acc_KN

0.8212290502793296

In [35]:
# DecissionTreeClasifier
clf= DecisionTreeClassifier()
clf.fit(X_train, y_train)
y_pred=clf.predict(X_test)
acc_DT= accuracy_score(y_test,y_pred)#
acc_DT

0.7597765363128491

In [36]:
# RandomForestClassifier
clf= RandomForestClassifier()
clf.fit(X_train,y_train)
y_pred= clf.predict(X_test)
acc_RF= accuracy_score(y_test,y_pred)
acc_RF

0.8212290502793296

In [38]:
# GaussianNB
clf=GaussianNB()
clf.fit(X_train,y_train)
y_pred= clf.predict(X_test)
acc_NB= accuracy_score(y_test,y_pred)
acc_NB

0.7653631284916201

In [39]:
# SVC
clf=SVC()
clf.fit(X_train,y_train)
y_pred= clf.predict(X_test)
acc_SVC= accuracy_score(y_test, y_pred)
acc_SVC

0.8156424581005587

## A priori, el modelo que mejor predice es: # RandomForestClassifier

In [40]:
clf= RandomForestClassifier()
clf.fit(X_train,y_train)
y_pred= clf.predict(X_test)
acc_RF= accuracy_score(y_test,y_pred)
acc_RF

0.8156424581005587

In [41]:
test_file= "test.csv"
test= pd.read_csv(test_file)
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [43]:
df_original= pd.read_csv("train.csv")
df_original.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [44]:
test.describe()

       PassengerId      Pclass         Age       SibSp       Parch        Fare
count   418.000000  418.000000  332.000000  418.000000  418.000000  417.000000
mean   1100.500000    2.265550   30.272590    0.447368    0.392344   35.627188
std     120.810458    0.841838   14.181209    0.896760    0.981429   55.907576
min     892.000000    1.000000    0.170000    0.000000    0.000000    0.000000
25%     996.250000    1.000000   21.000000    0.000000    0.000000    7.895800
50%    1100.500000    3.000000   27.000000    0.000000    0.000000   14.454200
75%    1204.750000    3.000000   39.000000    1.000000    0.000000   31.500000
max    1309.000000    3.000000   76.000000    8.000000    9.000000  512.329200

In [45]:
test.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [46]:
test.Age= test.Age.fillna(test.Age.mean())
test.Fare= test.Fare.fillna(test.Fare.mean())

In [47]:
test.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          327
Embarked         0
dtype: int64

In [48]:
test.drop(["Name","Ticket","Cabin","PassengerId"],axis=1,inplace=True)
test.head()

   Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0       3    male  34.5      0      0   7.8292        Q
1       3  female  47.0      1      0   7.0000        S
2       2    male  62.0      0      0   9.6875        Q
3       3    male  27.0      0      0   8.6625        S
4       3  female  22.0      1      1  12.2875        S

In [49]:
test.Age= (test.Age - np.mean(test.Age, axis=0))/ (np.std(test.Age, axis=0))
test.Fare= (test.Fare - np.mean(test.Age, axis=0))/ (np.std(test.Fare, axis=0))
test.head()

   Pclass     Sex       Age  SibSp  Parch      Fare Embarked
0       3    male  0.334993      0      0  0.140374        Q
1       3  female  1.325530      1      0  0.125507        S
2       2    male  2.514175      0      0  0.173693        Q
3       3    male -0.259330      0      0  0.155315        S
4       3  female -0.655545      1      1  0.220310        S

In [50]:
test= pd.get_dummies(test, columns=["Sex","Pclass","Embarked"], drop_first=True)
test.head()

,Age,SibSp,Parch,Fare,Sex_male,Pclass_2,Pclass_3,Embarked_Q,Embarked_S
0,0.334993,0,0,0.140374,True,False,True,True,False
1,1.325530,1,0,0.125507,False,False,True,False,True
2,2.514175,0,0,0.173693,True,True,False,True,False
3,-0.259330,0,0,0.155315,True,False,True,False,True
4,-0.655545,1,1,0.220310,False,False,True,False,True

## Predicci√≥n usando Test

In [53]:
# Se utiliza KNeighborsClassifier
clf= KNeighborsClassifier()
# Se entrena con los datos del primer dataset
clf.fit(X_train,y_train)
# Se predice sobre los datos de "test"
y_predict= clf.predict(test)
y_predict

array([0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 1, 1, 1, 1, 1, 0, 1, 1,
       1, 1, 1, 0, 1, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 1,
       1, 0, 0, 0, 1, 1, 0, 0, 1, 1, 0, 0, 1, 0, 0, 1, 0, 0, 0, 1, 1, 1,
       1, 0, 1, 1, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 1, 1, 0, 0, 1, 0, 1, 0,
       1, 1, 0, 0, 1, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0,
       0, 1, 1, 1, 1, 1, 0, 1, 1, 1, 1, 0, 1, 0, 0, 1, 0, 1, 0, 0, 1, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1,
       0, 0, 1, 0, 0, 1, 1, 1, 1, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 1,
       1, 1, 1, 1, 0, 1, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 1, 1, 1, 0,
       0, 0, 1, 1, 1, 1, 0, 1, 1, 0, 1, 0, 1, 0, 0, 1, 0, 0, 1, 1, 1, 0,
       1, 0, 1, 0, 1, 1, 0, 1, 0, 0, 0, 1, 0, 0, 1, 0, 1, 1, 1, 1, 1, 1,
       0, 0, 0, 0, 1, 0, 1, 1, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 1,
       0, 0, 1, 0, 0, 0, 1, 0, 1, 1, 0, 1, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1,
       0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 1, 1,
       0, 0, 0, 1, 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 1, 0, 0,
       1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 0, 1, 1, 0,
       0, 0, 1, 0, 1, 0, 0, 1, 0, 1, 1, 0, 1, 0, 0, 1, 1, 0, 0, 1, 1, 0,
       1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 1, 1, 0, 0, 1,
       0, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 1, 1, 1, 1, 1, 1, 0, 1, 0, 0, 0])

## Trabajando con Submission.csv

In [57]:
df_submission= pd.read_csv("gender_submission.csv")
df_submission.head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

In [59]:
df_submission["Survived"]= y_predict
df_submission.head()

   PassengerId  Survived
0          892         0
1          893         0
2          894         0
3          895         0
4          896         0

In [ ]:
df_submission.to_csv("titanic_pred.csv", index=False)